[
    {
        "Id": "ariel-id",
        "Email": "ariel@test.com",
        "Gender": "female",
        "DateOfBirth": "1989-05-23",
        "DisplayName": "Ariel",
        "Created": "2025-07-02",
        "LastActive": "2025-07-16",
        "Description": "Redhead with serious shellphone addiction. Grew up under the sea, now exploring the land. I love singing, exploring shipwrecks, and collecting human stuff (you wouldn't believe what people throw away!). Big fan of dinglehoppers, seagull fashion tips, and beach picnics. I speak fluent dolphin and have a crab bestie who thinks he is my life coach. Looking for someone adventurous, kind, and cool with the occasional splash. Bonus if you can dance, sail, or tell me what a “snarfblatt” actually does. Must love music and tolerate spontaneous underwater concerts. \r\n",
        "City": "Atlantica",
        "Country": "Ocean Kingdom (Under the Sea)",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877457/ariel_gnjqwl.jpg"
    },
    {
        "Id": "jasmine-id",
        "Email": "jasmine@test.com",
        "Gender": "female",
        "DateOfBirth": "1992-10-25",
        "DisplayName": "Jasmine",
        "Created": "2025-07-07",
        "LastActive": "2025-07-16",
        "Description": "Royal with a rebellious streak. I have got a palace, a tiger, and zero patience for being told what to do. Fluent in sass and carpet travel. I sneak out often (do not tell the guards) and love stargazing from rooftops. I value honesty, adventure, and a good heart over gold. Must be okay with heights, magic lamps, and the occasional genie appearance. Looking for someone who treats me like a partner, not a prize. Bonus if you have got your own ride, preferably one that flies.\r\n",
        "City": "Agrabah",
        "Country": "Desert Kingdom",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877468/jasmine_fiwx9n.jpg"
    },
    {
        "Id": "megara-id",
        "Email": "megara@test.com",
        "Gender": "female",
        "DateOfBirth": "1997-06-27",
        "DisplayName": "Megara",
        "Created": "2025-07-18",
        "LastActive": "2025-07-18",
        "Description": "Sarcasm is my love language. I have been burned before (long story involving gods - do not ask), but I am giving this whole dating thing another shot. Not your typical damsel, I rescue myself, thanks. I enjoy witty banter, dramatic sunsets, and not selling my soul to the Lord of the Underworld (again). If you are brave, kind, and have a thing for complicated women with killer hair and sharp comebacks, we might click. Must be able to handle eye rolls and honesty. Bonus points if you can lift a boulder or two.\r\n",
        "City": "Thebes",
        "Country": "Greece",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877471/megara_ncqccs.jpg"
    },
    {
        "Id": "mulan-id",
        "Email": "mulan@test.com",
        "Gender": "female",
        "DateOfBirth": "1998-06-05",
        "DisplayName": "Mulan",
        "Created": "2025-07-09",
        "LastActive": "2025-07-14",
        "Description": "Family hero, national icon, occasional sword-wielder. I once saved China disguised as a man, so yeah, I like to keep things interesting. I am into strategy games and peaceful gardens... when I am not training or saving the day. Independent, courageous, and not afraid to break a few rules for what is right. Looking for someone who respects honor and humor. Must be cool with dragons (mine is chatty), snow fights, and spontaneous horse rides into battle. Bonus if you sing well, but only during montages. \r\n",
        "City": "Han Village",
        "Country": "China",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877471/mulan_mtbs5p.jpg"
    },
    {
        "Id": "belle-id",
        "Email": "belle@test.com",
        "Gender": "female",
        "DateOfBirth": "1991-11-22",
        "DisplayName": "Belle",
        "Created": "2025-07-01",
        "LastActive": "2025-07-12",
        "Description": "Small-town girl with big dreams and an even bigger library card. I love books, candlelit dinners (especially when the candlesticks talk), and deep conversations about far-off places. I value kindness over appearances and brains over brawn. Looking for someone who does not mind enchanted furniture, spontaneous waltzes, or the occasional magical mishap. Bonus if you can read, respect strong women, and enjoy quiet mornings with coffee and a good story. Must love dogs… or teacups with faces.\r\n",
        "City": "Villeneuve",
        "Country": "France",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877462/belle_zr5yld.jpg"
    },
    {
        "Id": "hercules-id",
        "Email": "hercules@test.com",
        "Gender": "male",
        "DateOfBirth": "1997-06-27",
        "DisplayName": "Hercules",
        "Created": "2025-07-18",
        "LastActive": "2025-07-18",
        "Description": "Full-time god, part-time hero, all-around nice guy. I have wrestled monsters, battled Titans, and once punched a Hydra (long story). But honestly? I am just looking for someone who sees the real me, not just the muscles. I love training, stargazing, and spending time with my flying horse. I will go the distance for the right person. Must be okay with spontaneous heroics, lightning bolt relatives, and satyrs who give questionable advice. Bonus if you can sing along with the Muses or keep up during epic quests.\r\n",
        "City": "Thebes",
        "Country": "Greece",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877466/hercules_jsgoap.jpg"
    },
    {
        "Id": "jafar-id",
        "Email": "jafar@test.com",
        "Gender": "male",
        "DateOfBirth": "1980-11-25",
        "DisplayName": "Jafar",
        "Created": "2025-07-14",
        "LastActive": "2025-07-18",
        "Description": "Tall, mysterious, and definitely not your average royal advisor. I am into power, dramatic entrances, and talking birds who insult people for me. Love languages: manipulation and hypnotic staff gazes. Looking for someone ambitious, stylish, and unafraid of a little world domination. Must enjoy desert heat, snake metaphors, and occasional genie transformations. Not interested in street rats or flying carpets. Bonus if you can help overthrow a sultan or at least enjoy fancy robes and a good evil laugh.\r\n",
        "City": "Agrabah",
        "Country": "Desert Empire",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877468/jafar_glo0yg.jpg"
    },
    {
        "Id": "esmeralda-id",
        "Email": "esmeralda@test.com",
        "Gender": "female",
        "DateOfBirth": "1996-02-15",
        "DisplayName": "Esmeralda",
        "Created": "2025-07-12",
        "LastActive": "2025-07-15",
        "Description": "Dancer, dreamer, and defender of the underdog. I live for freedom, firelight, and standing up for what’s right, preferably while wearing bangles and twirling. I have got a soft spot for outcasts, a sharp tongue for injustice, and a goat who is basically my roommate. Looking for someone brave, kind, and passionate about making the world better (bonus if you can keep up on the dance floor). Must love music, magic, and midnight rooftop views of Notre Dame. No cowards, no judges, and absolutely no torches.\r\n",
        "City": "Paris",
        "Country": "France",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877461/esmeralda_wv7hdp.jpg"
    },
    {
        "Id": "beast-id",
        "Email": "beast@test.com",
        "Gender": "male",
        "DateOfBirth": "1990-11-22",
        "DisplayName": "Prince Adam (a.k.a. The Beast)",
        "Created": "2025-07-16",
        "LastActive": "2025-07-18",
        "Description": "Reformed beast with a big heart (and formerly big claws). Used to have anger issues, now I am more into reading, rose gardening, and dancing in ballrooms with magical furniture. Castle is huge, staff is enchanted, and dinner is always an event. Looking for someone who sees past appearances and enjoys a quiet night by the fire with a good book. Must be kind, curious, and okay with occasional roaring. Bonus if you are not afraid of enchanted objects or falling in love under a time-sensitive flower. \r\n",
        "City": "Enchanted Castle",
        "Country": "France",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877465/beast_ngkxdh.jpg"
    },
    {
        "Id": "lishang-id",
        "Email": "lishang@test.com",
        "Gender": "male",
        "DateOfBirth": "1998-06-05",
        "DisplayName": "Li Shang",
        "Created": "2025-07-15",
        "LastActive": "2025-07-18",
        "Description": "Commander by day, loyal friend always. I train warriors, climb poles with weights, and sing motivational anthems. Serious about honor, discipline, and teamwork, but I also enjoy peaceful walks, tea, and learning from people who surprise me. Looking for someone brave, thoughtful, and not afraid to challenge tradition (or spar with a sword). Must respect family, fitness, and feelings and yes, I have those. Bonus if you are great under pressure and can defeat the Huns before breakfast. Shirtless training montage optional, but encouraged.\r\n",
        "City": "Imperial City",
        "Country": "China",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877468/lishang_jo0h5t.jpg"
    },
    {
        "Id": "tarzan-id",
        "Email": "tarzan@test.com",
        "Gender": "male",
        "DateOfBirth": "1999-06-18",
        "DisplayName": "Tarzan",
        "Created": "2025-07-06",
        "LastActive": "2025-07-18",
        "Description": "Jungle-raised, vine-swinging nature lover with zero cell signal but tons of heart. Fluent in gorilla, barefoot 24/7, and totally shredded from climbing trees all day. I value loyalty, curiosity, and chest-thumping honesty. I may not own a shirt, but I can offer adventure, banana-sharing, and deep conversations under the stars. Looking for someone open-minded, brave, and not afraid of a few jungle bugs. Bonus if you like animals, can teach me words like “porcelain”, and do not mind a wild side. \r\n",
        "City": "Deep Jungle",
        "Country": "Unknown (somewhere beautifully green)",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877474/tarzan_qjlljx.jpg"
    },
    {
        "Id": "quasimodo-id",
        "Email": "quasimodo@test.com",
        "Gender": "male",
        "DateOfBirth": "1995-03-02",
        "DisplayName": "Quasimodo",
        "Created": "2025-07-11",
        "LastActive": "2025-07-17",
        "Description": "Bell ringer, sculptor, and rooftop philosopher. I may live high above the city, but I see everything with a heart full of wonder. Quiet by nature, loyal to the core, and always up for a view that takes your breath away. Looking for someone who sees beyond appearances and values kindness, music, and inner strength. Must enjoy Gothic architecture, ringing in holidays, and chatting with statues (they are great listeners). Bonus if you love sunsets, stories, and believe that beauty comes from within.\r\n",
        "City": "Notre Dame Cathedral",
        "Country": "France",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877472/quasimodo_vhk7go.jpg"
    },
    {
        "Id": "aladdin-id",
        "Email": "aladdin@test.com",
        "Gender": "male",
        "DateOfBirth": "1992-11-25",
        "DisplayName": "Aladdin",
        "Created": "2025-07-08",
        "LastActive": "2025-07-18",
        "Description": "Former street rat turned prince, with a magic carpet and a heart of gold. I know how to show you a whole new world (literally). Big fan of adventure, clever plans, and late-night rooftop talks with a view. My best friend is a genie, my pet monkey is a kleptomaniac, and I have serious lamp experience. Looking for someone who values honesty, fun, and can handle surprises. Must be okay with flying, singing duets, and dodging palace guards. Bonus if you have ever dreamed of escaping the ordinary.\r\n",
        "City": "Agrabah",
        "Country": "Desert Kingdom",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877457/aladdin_bh9eyf.jpg"
    },
    {
        "Id": "aurora-id",
        "Email": "aurora@test.com",
        "Gender": "female",
        "DateOfBirth": "1959-01-29",
        "DisplayName": "Aurora",
        "Created": "2025-07-02",
        "LastActive": "2025-07-18",
        "Description": "Sleeping beauty here (literally). Known for long naps, perfect hair, and excellent forest dance moves. Raised by fairies, besties with woodland creatures, and accidentally pricked a spindle once (oops). I adore dreamy walks, classic romance, and songs that start without warning. Looking for someone gentle, kind, and able to find me in a crowd, just follow the birds singing. Must be okay with spontaneous curses, magical wardrobes, and me occasionally dozing off mid-date. Bonus if you can charm my fairy godmothers and do not mind if I talk to squirrels. \r\n",
        "City": "Forest Cottage (formerly the castle)",
        "Country": "Kingdom of Enchanted Woods",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877458/aurora_d8qbna.jpg"
    },
    {
        "Id": "ursula-id",
        "Email": "ursula@test.com",
        "Gender": "female",
        "DateOfBirth": "1979-11-17",
        "DisplayName": "Ursula",
        "Created": "2025-07-13",
        "LastActive": "2025-07-17",
        "Description": "Curvy, confident, and clever; some call me a villain, I prefer “misunderstood entrepreneur.” I make dreams come true... for a small price. Love magic, dramatic monologues, and singing power ballads in stormy weather. Looking for someone bold, witty, and not afraid of the occasional spell. Must enjoy seafood, contracts written in ink (and blood), and empowering plus-size sea witches. No flakes, no guppies, no princes named Eric. Bonus if you bring snacks and... your voice.\r\n",
        "City": "The Abyssal Lair",
        "Country": "Deep Sea Territories",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877473/ursula_kbdbyj.avif"
    },
    {
        "Id": "gaston-id",
        "Email": "gaston@test.com",
        "Gender": "male",
        "DateOfBirth": "1991-07-30",
        "DisplayName": "Gaston",
        "Created": "2025-07-12",
        "LastActive": "2025-07-15",
        "Description": "No one writes a dating bio like Gaston! Tall, strong, ruggedly handsome, basically perfection. I eat five dozen eggs daily and flex for fun. Expert hunter, town heartthrob, and occasional song leader (with backup from LeFou). Looking for someone who appreciates a real man: broad chin, bigger ego, and zero interest in reading. Bonus points if you faint when I enter a room or knit me a belt from your hair. Must love mirrors, me, and… well, mostly me.\r\n",
        "City": "Musclebourg",
        "Country": "France",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877465/gaston_avbk7z.jpg"
    },
    {
        "Id": "eric-id",
        "Email": "eric@test.com",
        "Gender": "male",
        "DateOfBirth": "1987-12-10",
        "DisplayName": "Eric",
        "Created": "2025-07-02",
        "LastActive": "2025-07-08",
        "Description": "Sailor. Dog lover. Prince. I play the flute, steer ships through storms, and occasionally rescue mysterious girls from the sea. I enjoy beach strolls, sunset sails, and getting lost in music. Looking for someone adventurous, kind, and maybe a little curious about life beyond the shore. Bonus if you sing beautifully without moving your lips (long story). Boat experience not required, just a sense of wonder.\r\n",
        "City": "Coral Bay Port",
        "Country": "Coastline Kingdom",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877785/eric_s21ego.png"
    },
    {
        "Id": "hades-id",
        "Email": "hades@test.com",
        "Gender": "male",
        "DateOfBirth": "1950-11-01",
        "DisplayName": "Hades",
        "Created": "2025-07-03",
        "LastActive": "2025-07-12",
        "Description": "Lord of the Underworld, master of deals, and full-time flame-haired icon. I have got a great sense of humor (dark, obviously), a thriving netherworld business, and zero patience for drama, unless I am the one causing it. Looking for someone with brains, backbone, and a taste for chaos (romantic or otherwise). Must be okay with skeleton staff, fire hair, and the occasional Olympian family feud. Bonus if you can keep up with fast talk, faster plots, and enjoy long walks by the River Styx.\r\n",
        "City": "Underworld HQ",
        "Country": "Realm of the Dead",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877463/hades_fvhalw.jpg"
    },
    {
        "Id": "phoebus-id",
        "Email": "phoebus@test.com",
        "Gender": "male",
        "DateOfBirth": "1995-05-15",
        "DisplayName": "Phoebus",
        "Created": "2025-07-08",
        "LastActive": "2025-07-12",
        "Description": "Chivalry with a side of sarcasm. I am a decorated captain who swapped marching orders for doing what is actually right. Known for dramatic entrances on horseback and smooth exits with sass. I enjoy sword duels, moonlit strolls through Paris, and petting my dog while pretending not to fall for bold, beautiful rebels. Looking for someone fearless, clever, and allergic to injustice. Bonus if you have a cause worth fighting for and do not mind a little armor clank on date nights.\r\n",
        "City": "Paris",
        "Country": "France",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877471/phoebus_cbq89b.jpg"
    },
    {
        "Id": "maleficent-id",
        "Email": "maleficent@test.com",
        "Gender": "female",
        "DateOfBirth": "1958-01-03",
        "DisplayName": "Maleficent",
        "Created": "2025-07-08",
        "LastActive": "2025-07-09",
        "Description": "Tall, magical, and occasionally misunderstood. I throw fabulous curses, rock dramatic capes, and turn into a dragon when I am moody (do not worry, it is rare… ish). I appreciate loyalty, elegance, and people who RSVP to things. Looking for someone who enjoys misty moors, dark humor, and does not mind the occasional spinning wheel sabotage. Must respect boundaries, birds, and power. Bonus if you are brave enough to stand beside me, but smart enough never to stand in my way.\r\n",
        "City": "Forbidden Mountain",
        "Country": "Moors",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877468/maleficent_ubu4u4.jpg"
    },
    {
        "Id": "phillip-id",
        "Email": "phillip@test.com",
        "Gender": "male",
        "DateOfBirth": "1958-01-15",
        "DisplayName": "Phillip",
        "Created": "2025-07-16",
        "LastActive": "2025-07-17",
        "Description": "I am a noble guy who is into forest hikes, epic quests, and staying calm during magical emergencies. I have got solid castle real estate, great hair, and a dragon-slaying record that speaks for itself. Looking for someone with heart, humor, and a love for all things enchanted. I value loyalty, courage, and being on time for royal balls. Bonus if you enjoy dancing, have fairy godmother connections, or can handle a little adventure. No evil curses, hidden identities, or sleeping spells this time, please.\r\n",
        "City": "Enchanted Forest Outskirts",
        "Country": "United Kingdom of Highlands",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877470/phillip_xurolv.jpg"
    },
    {
        "Id": "genie-id",
        "Email": "genie@test.com",
        "Gender": "male",
        "DateOfBirth": "1960-10-10",
        "DisplayName": "Genie",
        "Created": "2025-07-09",
        "LastActive": "2025-07-16",
        "Description": "Former lamp resident, now living life wish-free and fabulous! I am 100% magic, 1000% personality. I love impersonations, show tunes, and popping into new places with style (and sparkles). Looking for someone who can keep up with my energy and does not take life too seriously. Must love laughter, flying carpets, and spontaneous musical numbers. I do not do wishes anymore, unless it is for tacos. Bonus if you dance, laugh at puns, and believe in second chances. Warning: side effects may include excessive fun and minor glitter explosions.\r\n",
        "City": "Anywhere",
        "Country": "Everywhere",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877463/genie_fpb0ib.jpg"
    },
    {
        "Id": "pocahontas-id",
        "Email": "pocahontas@test.com",
        "Gender": "female",
        "DateOfBirth": "1995-06-24",
        "DisplayName": "Pocahontas",
        "Created": "2025-07-18",
        "LastActive": "2025-07-18",
        "Description": "Free spirit with a deep love for nature, adventure, and listening to the worlds whispers. I paddle faster than your kayak, talk to raccoons, and give great life advice via wind metaphors. Looking for someone who respects the land, values balance, and is not afraid of a little soul-searching. I do not need riches, just honesty, kindness, and curiosity about the world. Must love quiet forests, wild rivers, and talking trees. Bonus if you can paint with all the colors of the wind, or at least not litter.\r\n",
        "City": "Riverbend Village",
        "Country": "Powhatan Territories",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877474/pocahontas_ao0tyw.jpg"
    },
    {
        "Id": "jane-id",
        "Email": "jane@test.com",
        "Gender": "female",
        "DateOfBirth": "1999-06-18",
        "DisplayName": "Jane",
        "Created": "2025-07-14",
        "LastActive": "2025-07-14",
        "Description": "British explorer with a love for sketchbooks, strange birds, and unexpectedly charming wild men. Former city girl now thriving in the jungle (humidity is brutal, but worth it). I am endlessly curious, quick with a quote, and not afraid to swing into new experiences (literally). Looking for someone intelligent, adventurous, and willing to wrestle a gorilla for me (just kidding… mostly). Must enjoy tea, treehouses, and conversations with monkeys. Bonus if you can teach me to vine-surf or speak fluent gorilla.\r\n",
        "City": "Greystoke Research Camp",
        "Country": "United Kingdom (currently based in the jungle)",
        "ImageUrl": "https://res.cloudinary.com/dhtmbebsv/image/upload/v1752877468/jane_ax1axx.jpg"
    }
]